turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LS8C.atdf
        <register name="HRPCR" offset="0x64" rw="RW" size="4" access-size="4" caption="High Resolution Prescaler Control Register">
          <bitfield name="HRPEN" caption="High Resolution Prescaler Enable" mask="0x1"/>
          <bitfield name="CKSEL" caption="Clock Input Selection" mask="0xE"/>
          <bitfield name="HRCOUNT" caption="High Resolution Counter" mask="0xFFFFFF00"/>
        </register>
        <register name="FPCR" offset="0x68" rw="RW" size="4" access-size="4" caption="Fractional Prescaler Control Register">
          <bitfield name="FPEN" caption="High Resolution Prescaler Enable" mask="0x1"/>
          <bitfield name="CKSEL" caption="Clock Input Selection" mask="0xE"/>
        </register>
        <register name="FPMUL" offset="0x6C" rw="RW" size="4" access-size="4" caption="Fractional Prescaler Multiplier Register">
          <bitfield name="FPMUL" caption="Fractional Prescaler Multiplication Factor" mask="0xFFFF"/>
        </register>
        <register name="FPDIV" offset="0x70" rw="RW" size="4" access-size="4" caption="Fractional Prescaler DIVIDER Register">
          <bitfield name="FPDIV" caption="Fractional Prescaler Division Factor" mask="0xFFFF"/>
        </register>
        <register name="GCCTRL" offset="0x74" rw="RW" size="4" access-size="4" count="12" initval="0x00000000" caption="Generic Clock Control">
          <bitfield name="CEN" caption="Clock Enable" mask="0x1"/>
          <bitfield name="DIVEN" caption="Divide Enable" mask="0x2"/>
          <bitfield name="OSCSEL" caption="Clock Select" mask="0x1F00"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
        <register name="RCFASTVERSION" offset="0x3D8" rw="R" size="4" access-size="4" caption="4/8/12 MHz RC Oscillator Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="GCLKPRESCVERSION" offset="0x3DC" rw="R" size="4" access-size="4" caption="Generic Clock Prescaler Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="PLLIFAVERSION" offset="0x3E0" rw="R" size="4" access-size="4" caption="PLL Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant nubmer" mask="0xF0000"/>
        </register>
        <register name="OSCIFAVERSION" offset="0x3E4" rw="R" size="4" access-size="4" caption="Oscillator 0 Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant nubmer" mask="0xF0000"/>
        </register>
        <register name="DFLLIFBVERSION" offset="0x3E8" rw="R" size="4" access-size="4" caption="DFLL Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="RCOSCIFAVERSION" offset="0x3EC" rw="R" size="4" access-size="4" caption="System RC Oscillator Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="FLOVERSION" offset="0x3F0" rw="R" size="4" access-size="4" caption="Frequency Locked Oscillator Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="RC80MVERSION" offset="0x3F4" rw="R" size="4" access-size="4" caption="80MHz RC Oscillator Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="GCLKIFVERSION" offset="0x3F8" rw="R" size="4" access-size="4" caption="Generic Clock Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="VERSION" offset="0x3FC" rw="R" size="4" access-size="4" initval="0x00000130" caption="SCIF Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="SMAP" id="I8321" version="1.0.0" caption="System Manager Access Port">
      <register-group name="SMAP" caption="System Manager Access Port">
        <register name="CR" offset="0x0" rw="W" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="DIS" caption="Disable" mask="0x2"/>
          <bitfield name="CRC" caption="User Page Read" mask="0x4"/>
          <bitfield name="FSPR" caption="Flash Supplementary Page Read" mask="0x8"/>
          <bitfield name="CE" caption="Chip Erase" mask="0x10"/>
        </register>
        <register name="SR" offset="0x4" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="DONE" caption="Operation done" mask="0x1"/>
          <bitfield name="HCR" caption="Hold Core reset" mask="0x2"/>
          <bitfield name="BERR" caption="Bus error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="LCK" caption="Lock" mask="0x10"/>
          <bitfield name="EN" caption="Enabled" mask="0x100"/>
          <bitfield name="PROT" caption="Protected" mask="0x200"/>
          <bitfield name="DBGP" caption="Debugger Present" mask="0x400"/>
          <bitfield name="STATE" caption="State" mask="0x7000000"/>
        </register>
