turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LS8C.atdf
        <register name="BRGR" offset="0x20" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Baud Rate Generator Register">
          <bitfield name="CD" caption="Clock Divisor" mask="0xFFFF" values="USART_BRGR__CD"/>
          <bitfield name="FP" caption="Fractional Part" mask="0x70000" values="USART_BRGR__FP"/>
        </register>
        <register name="RTOR" offset="0x24" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Receiver Time-out Register">
          <bitfield name="TO" caption="Time-out Value" mask="0x1FFFF" values="USART_RTOR__TO"/>
        </register>
        <register name="TTGR" offset="0x28" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Transmitter Timeguard Register">
          <bitfield name="TG" caption="Timeguard Value" mask="0xFF" values="USART_TTGR__TG"/>
        </register>
        <register name="FIDI" offset="0x40" rw="RW" size="4" access-size="4" initval="0x00000174" caption="FI DI Ratio Register">
          <bitfield name="FI_DI_RATIO" caption="FI Over DI Ratio Value" mask="0x7FF" values="USART_FIDI__FI_DI_RATIO"/>
        </register>
        <register name="NER" offset="0x44" rw="R" size="4" access-size="4" initval="0x00000000" caption="Number of Errors Register">
          <bitfield name="NB_ERRORS" caption="Error number during ISO7816 transfers" mask="0xFF"/>
        </register>
        <register name="IFR" offset="0x4C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="IrDA Filter Register">
          <bitfield name="IRDA_FILTER" caption="Irda filter" mask="0xFF"/>
        </register>
        <register name="MAN" offset="0x50" rw="RW" size="4" access-size="4" initval="0x30011004" caption="Manchester Configuration Register">
          <bitfield name="TX_PL" caption="Transmitter Preamble Length" mask="0xF" values="USART_MAN__TX_PL"/>
          <bitfield name="TX_PP" caption="Transmitter Preamble Pattern" mask="0x300" values="USART_MAN__TX_PP"/>
          <bitfield name="TX_MPOL" caption="Transmitter Manchester Polarity" mask="0x1000" values="USART_MAN__TX_MPOL"/>
          <bitfield name="RX_PL" caption="Receiver Preamble Length" mask="0xF0000" values="USART_MAN__RX_PL"/>
          <bitfield name="RX_PP" caption="Receiver Preamble Pattern detected" mask="0x3000000" values="USART_MAN__RX_PP"/>
          <bitfield name="RX_MPOL" caption="Receiver Manchester Polarity" mask="0x10000000" values="USART_MAN__RX_MPOL"/>
          <bitfield name="DRIFT" caption="Drift compensation" mask="0x40000000" values="USART_MAN__DRIFT"/>
        </register>
        <register name="LINMR" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="LIN Mode Register">
          <bitfield name="NACT" caption="LIN Node Action" mask="0x3" values="USART_LINMR__NACT"/>
          <bitfield name="PARDIS" caption="Parity Disable" mask="0x4"/>
          <bitfield name="CHKDIS" caption="Checksum Disable" mask="0x8"/>
          <bitfield name="CHKTYP" caption="Checksum Type" mask="0x10"/>
          <bitfield name="DLM" caption="Data Length Mode" mask="0x20"/>
          <bitfield name="FSDIS" caption="Frame Slot Mode Disable" mask="0x40"/>
          <bitfield name="WKUPTYP" caption="Wakeup Signal Type" mask="0x80"/>
          <bitfield name="DLC" caption="Data Length Control" mask="0xFF00"/>
          <bitfield name="PDCM" caption="PDC Mode" mask="0x10000"/>
          <bitfield name="SYNCDIS" caption="Synchronization Disable" mask="0x20000"/>
        </register>
        <register name="LINIR" offset="0x58" rw="RW" size="4" access-size="4" initval="0x00000000" caption="LIN Identifier Register">
          <bitfield name="IDCHR" caption="Identifier Character" mask="0xFF"/>
        </register>
        <register name="LINBRR" offset="0x5C" rw="R" size="4" access-size="4" initval="0x00000000" caption="LIN Baud Rate Register">
          <bitfield name="LINCD" caption="Clock Divider after Synchronization" mask="0xFFFF"/>
          <bitfield name="LINFP" caption="Fractional Part after Synchronization" mask="0x70000"/>
        </register>
        <register name="WPMR" offset="0xE4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Write Protect Mode Register">
          <bitfield name="WPEN" caption="Write Protect Enable" mask="0x1" values="USART_WPMR__WPEN"/>
          <bitfield name="WPKEY" caption="Write Protect Key" mask="0xFFFFFF00"/>
        </register>
        <register name="WPSR" offset="0xE8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Write Protect Status Register">
          <bitfield name="WPV" caption="Write Protect Violation Status" mask="0x1" values="USART_WPSR__WPV"/>
          <bitfield name="WPVSRC" caption="Write Protect Violation Source" mask="0xFFFF00"/>
        </register>
        <register name="VERSION" offset="0xFC" rw="R" size="4" access-size="4" initval="0x00000602" caption="Version Register">
          <bitfield name="VERSION" caption="Version" mask="0xFFF"/>
          <bitfield name="MFN" caption="MFN" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="USART_CR__DTRDIS">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Drives the pin DTR to 1" value="1"/>
      </value-group>
      <value-group name="USART_CR__DTREN">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Drives the pin DTR at 0" value="1"/>
      </value-group>
      <value-group name="USART_CR__RETTO">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Restart Time-out" value="1"/>
      </value-group>
      <value-group name="USART_CR__RSTIT">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Resets ITERATION in CSR. No effect if the ISO7816 is not enabled" value="1"/>
      </value-group>
      <value-group name="USART_CR__RSTNACK">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Resets NACK in CSR" value="1"/>
      </value-group>
