turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LS8C.atdf
        <register name="UECON4" offset="0x1D0" rw="R" size="4" access-size="4" initval="0x00000000" caption="Endpoint Control Register">
          <bitfield name="TXINE" caption="TXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="RXOUTE" caption="RXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="RXSTPE" caption="RXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="NAKOUTE" caption="NAKOUT Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKINE" caption="NAKIN Interrupt Enable" mask="0x10"/>
          <bitfield name="STALLEDE" caption="STALLED Interrupt Enable" mask="0x40"/>
          <bitfield name="NREPLY" caption="No Reply" mask="0x100"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x800"/>
          <bitfield name="NBUSYBKE" caption="Number of Busy Banks Interrupt Enable" mask="0x1000"/>
          <bitfield name="KILLBK" caption="Kill IN Bank" mask="0x2000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="NYETDIS" caption="NYET Token Enable" mask="0x20000"/>
          <bitfield name="RSTDT" caption="Reset Data Toggle" mask="0x40000"/>
          <bitfield name="STALLRQ" caption="STALL Request" mask="0x80000"/>
          <bitfield name="BUSY0" caption="Busy Bank1 Enable" mask="0x1000000"/>
          <bitfield name="BUSY1" caption="Busy Bank0 Enable" mask="0x2000000"/>
        </register>
        <register name="UECON5" offset="0x1D4" rw="R" size="4" access-size="4" initval="0x00000000" caption="Endpoint Control Register">
          <bitfield name="TXINE" caption="TXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="RXOUTE" caption="RXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="RXSTPE" caption="RXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="NAKOUTE" caption="NAKOUT Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKINE" caption="NAKIN Interrupt Enable" mask="0x10"/>
          <bitfield name="STALLEDE" caption="STALLED Interrupt Enable" mask="0x40"/>
          <bitfield name="NREPLY" caption="No Reply" mask="0x100"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x800"/>
          <bitfield name="NBUSYBKE" caption="Number of Busy Banks Interrupt Enable" mask="0x1000"/>
          <bitfield name="KILLBK" caption="Kill IN Bank" mask="0x2000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="NYETDIS" caption="NYET Token Enable" mask="0x20000"/>
          <bitfield name="RSTDT" caption="Reset Data Toggle" mask="0x40000"/>
          <bitfield name="STALLRQ" caption="STALL Request" mask="0x80000"/>
          <bitfield name="BUSY0" caption="Busy Bank1 Enable" mask="0x1000000"/>
          <bitfield name="BUSY1" caption="Busy Bank0 Enable" mask="0x2000000"/>
        </register>
        <register name="UECON6" offset="0x1D8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Endpoint Control Register">
          <bitfield name="TXINE" caption="TXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="RXOUTE" caption="RXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="RXSTPE" caption="RXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="NAKOUTE" caption="NAKOUT Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKINE" caption="NAKIN Interrupt Enable" mask="0x10"/>
          <bitfield name="STALLEDE" caption="STALLED Interrupt Enable" mask="0x40"/>
          <bitfield name="NREPLY" caption="No Reply" mask="0x100"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x800"/>
          <bitfield name="NBUSYBKE" caption="Number of Busy Banks Interrupt Enable" mask="0x1000"/>
          <bitfield name="KILLBK" caption="Kill IN Bank" mask="0x2000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="NYETDIS" caption="NYET Token Enable" mask="0x20000"/>
          <bitfield name="RSTDT" caption="Reset Data Toggle" mask="0x40000"/>
          <bitfield name="STALLRQ" caption="STALL Request" mask="0x80000"/>
          <bitfield name="BUSY0" caption="Busy Bank1 Enable" mask="0x1000000"/>
          <bitfield name="BUSY1" caption="Busy Bank0 Enable" mask="0x2000000"/>
        </register>
        <register name="UECON7" offset="0x1DC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Endpoint Control Register">
          <bitfield name="TXINE" caption="TXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="RXOUTE" caption="RXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="RXSTPE" caption="RXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="NAKOUTE" caption="NAKOUT Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKINE" caption="NAKIN Interrupt Enable" mask="0x10"/>
          <bitfield name="STALLEDE" caption="STALLED Interrupt Enable" mask="0x40"/>
          <bitfield name="NREPLY" caption="No Reply" mask="0x100"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x800"/>
          <bitfield name="NBUSYBKE" caption="Number of Busy Banks Interrupt Enable" mask="0x1000"/>
          <bitfield name="KILLBK" caption="Kill IN Bank" mask="0x2000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="NYETDIS" caption="NYET Token Enable" mask="0x20000"/>
          <bitfield name="RSTDT" caption="Reset Data Toggle" mask="0x40000"/>
          <bitfield name="STALLRQ" caption="STALL Request" mask="0x80000"/>
          <bitfield name="BUSY0" caption="Busy Bank1 Enable" mask="0x1000000"/>
          <bitfield name="BUSY1" caption="Busy Bank0 Enable" mask="0x2000000"/>
        </register>
        <register name="UECON0SET" offset="0x1F0" rw="W" size="4" access-size="4" atomic-op="set:UECON0" initval="0x00000000" caption="Endpoint Control Set Register">
          <bitfield name="TXINES" caption="TXINE Set" mask="0x1"/>
          <bitfield name="RXOUTES" caption="RXOUTE Set" mask="0x2"/>
          <bitfield name="RXSTPES" caption="RXSTPE Set" mask="0x4"/>
          <bitfield name="NAKOUTES" caption="NAKOUTE Set" mask="0x8"/>
          <bitfield name="NAKINES" caption="NAKINE Set" mask="0x10"/>
          <bitfield name="STALLEDES" caption="STALLEDE Set" mask="0x40"/>
          <bitfield name="NREPLYS" caption="NREPLY Set" mask="0x100"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x800"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="KILLBKS" caption="KILLBK Set" mask="0x2000"/>
          <bitfield name="NYETDISS" caption="NYETDIS Set" mask="0x20000"/>
          <bitfield name="RSTDTS" caption="RSTDT Set" mask="0x40000"/>
          <bitfield name="STALLRQS" caption="STALLRQ Set" mask="0x80000"/>
          <bitfield name="BUSY0S" caption="BUSY0 Set" mask="0x1000000"/>
          <bitfield name="BUSY1S" caption="BUSY1 Set" mask="0x2000000"/>
        </register>
        <register name="UECON1SET" offset="0x1F4" rw="W" size="4" access-size="4" atomic-op="set:UECON1" initval="0x00000000" caption="Endpoint Control Set Register">
          <bitfield name="TXINES" caption="TXINE Set" mask="0x1"/>
          <bitfield name="RXOUTES" caption="RXOUTE Set" mask="0x2"/>
          <bitfield name="RXSTPES" caption="RXSTPE Set" mask="0x4"/>
          <bitfield name="NAKOUTES" caption="NAKOUTE Set" mask="0x8"/>
          <bitfield name="NAKINES" caption="NAKINE Set" mask="0x10"/>
          <bitfield name="STALLEDES" caption="STALLEDE Set" mask="0x40"/>
          <bitfield name="NREPLYS" caption="NREPLY Set" mask="0x100"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x800"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="KILLBKS" caption="KILLBK Set" mask="0x2000"/>
          <bitfield name="NYETDISS" caption="NYETDIS Set" mask="0x20000"/>
          <bitfield name="RSTDTS" caption="RSTDT Set" mask="0x40000"/>
          <bitfield name="STALLRQS" caption="STALLRQ Set" mask="0x80000"/>
          <bitfield name="BUSY0S" caption="BUSY0 Set" mask="0x1000000"/>
          <bitfield name="BUSY1S" caption="BUSY1 Set" mask="0x2000000"/>
        </register>
